print('''Оберіть фігуру яку бажаєте відобразити серед доступних:
*  *  *  *  *       *                   *  *  *  *  *                           *  *  *  *  *
   *  *  *  *       *  *                   *  *  *                                 *  *  *   
      *  *  *       *  *  *                   *                   *                   *      
         *  *       *  *  *  *                                 *  *  *             *  *  *   
            *       *  *  *  *  *                           *  *  *  *  *       *  *  *  *  *
      1.                  2.                  3.                  4.                  5.

*           *       *                               *       *  *  *  *  *                   *
*  *     *  *       *  *                         *  *       *  *  *  *                   *  *
*  *  *  *  *       *  *  *                   *  *  *       *  *  *                   *  *  *
*  *     *  *       *  *                         *  *       *  *                   *  *  *  *
*           *       *                               *       *                   *  *  *  *  *
      6.                  7.                  8.                  9.                  10.''')
f = int(input('Для вибору фігури введіть її номер: '))
try:
    while not 1 <= f <= 10:
        print('Некоректно обрана фігура')
        print('Для виходу введіть 0')
        f = int(input('Введіть коректний номер фігури: '))
    else:
        print('b')
except Exception as e:
    print(e)
